%%: 声明
-ifndef(cfg_per_book).
-define(cfg_per_book, 1).

-record(per_bookCfg, {
        %%: 作者:
        %%: 本表的ID
        iD,

        %%: 作者:
        %%: 宠物的ID对应per表；
        per_id,

        %%: 作者:
        %%: 宠物的名字
        %%: 便于策划管理本表
        name,

        %%: 作者:
        %%: 所在标签页
        %%: 1.代表标签页1
        %%: 2.代表标签页2
        %%: 3.代表标签页3
        label,

        %%: 作者:
        %%: 所在标签页的位置
        position,

        %%: 作者:
        %%: 边框加金
        %%: 0.正常
        %%: 1.银边
        %%: 2.金边
        %%: 3.砖石边
        gold,

        %%: 作者:
        %%: 伤害成长的显示星星
        %%: 1-10代表星星数量
        growup_1,

        %%: 作者:
        %%: 生存成长的显示星星数量
        %%: 1-10代表星星数量
        growup_2,

        %%: 作者:
        %%: 辅助成长的星星数量
        %%: 1-10代表星星数量
        growup_3

 }).

-endif.